app/views/products/index.html.erb

SELECT "products".* FROM "products"
---
<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    var id = $(this).data("id");
    $.get("/products/" + id + ".json", function(product) {
      var inventoryText = "<strong>Available</strong>";
      if(product["inventory"] <= 0 ){
         inventoryText = "<strong>Sold Out</strong>";
      }
      var descriptionText = "<p>" + product["description"] + "</p><p>" + inventoryText + "</p>";
      $("#product-" + id).html(descriptionText);
      var orderText="<h5>Orders</h5><ul>";
      console.log("Product",product);
      console.log("Order count",product.orders.count);
      product.orders.forEach (function (order) {
        orderText += "<li>Order for customer " + order.customer.name + "</li>";
      });
      orderText += "</ul>";
      $("#product-"+id+"-orders").html(orderText);
    });
  });
});